app/views/book_audits/show_history.html.erb

  <% @book_audits.each do |book_audit| %>
    <% book = Book.find(book_audit.book_id) %>
    <% student = Student.find(book_audit.student_id) %>
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]