app/views/issues/index.html.erb

  <% @issues.each do |issue| %>
    <% book = Book.find(issue.book_id) %>
    <% student = Student.find(issue.student_id) %>
    <% lib = Library.find(book.library_id) %>
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]