app/views/issues/issued_books.html.erb

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "issues".* FROM "issues" WHERE "issues"."student_id" = ? LIMIT ?  [["student_id", 1], ["LIMIT", 1]]
---
<% student_id = params["id"].to_i %>
<% student_name = Student.find(student_id).name %>

<%= issued_books_array = Issue.find_by student_id: student_id %>