app/views/students/_form.html.erb

    <%= form.label :degree_to_book_mappings_id %>
    <%= select("student", "degree_to_book_mappings_id", DegreeToBookMapping.all.collect { |c| [c.educational_level, c.id] }) %>
---
SELECT "degree_to_book_mappings".* FROM "degree_to_book_mappings"