app/views/students/index.html.erb

    <% @students.each do |student| %>
     <% @education = DegreeToBookMapping.find(student.degree_to_book_mappings_id).educational_level %>
---
SELECT "degree_to_book_mappings".* FROM "degree_to_book_mappings" WHERE "degree_to_book_mappings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]