app/views/librarians/registrations/edit.html.erb

  <%= f.text_field :name %>
  <% library = Library.find(@librarian[:library_id]) %>
---
SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]