app/views/librarians/registrations/new.html.erb

SELECT "libraries".* FROM "libraries"
---

    <%= f.select :library_id, Library.all.collect { |c| [c.name, c.id] }, { label: "Chose your library: ", wrapper: {class: "selectpicker"}} %>