app/views/librarians/registrations/new.html.erb

SELECT "libraries".* FROM "libraries"
---
    <%= f.label :library_id %>
    <%= select("librarian", "library_id", Library.all.collect { |c| [c.name, c.id] }) %>