app/views/books/_form.html.erb

    <%= form.label :library_id %>
    <%= select("book", "library_id", Library.all.collect { |c| [c.name, c.id] }) %>
---
SELECT "libraries".* FROM "libraries"