app/views/books/_form.html.erb

    <%= form.label :library_id %>
    <%= form.select :library_id, Library.all.collect { |c| [c.name, c.id] }, {label: "Select library"} %>
---
SELECT "libraries".* FROM "libraries"