app/views/books/index.html.erb

    <% @books.each do |book| %>
      <% @lib = Library.find(book.library_id).name %>
---
SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

        <td><%= link_to 'Check Out', books_student_check_out_path(book), method: :post %></td>
          <% if Bookmark.find_by(student_id: (Student.find_by email: current_student.email).id, book_id: book.id).nil? %>
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."student_id" = $1 AND "bookmarks"."book_id" = $2 LIMIT $3  [["student_id", 1], ["book_id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."email" = $1 LIMIT $2  [["email", "ajain37@ncsu.edu"], ["LIMIT", 1]]