app/views/books/update_to_lib.html.erb

SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---

  <% @currlib = Library.find(current_librarian.library_id).name %>

SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    <% @books.each do |book| %>
      <% @lib = Library.find(book.library_id) %>