app/views/hold_requests/index.html.erb

  <% @hold_requests.each do |hold_request| %>
    <% book = Book.find(hold_request.book_id) %>
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]