app/controllers/students/omniauth_callbacks_controller.rb

  def facebook
    # You need to implement the method below in your model (e.g. app/models/student.rb)
    @student = Student.from_omniauth(request.env["omniauth.auth"])

    if request.env["omniauth.auth"].info.email.blank?
---
SELECT 1 AS one FROM "students" WHERE "students"."email" = $1 LIMIT $2  [["email", "jn.ayush@gmail.com"], ["LIMIT", 1]]