app/controllers/admin_home_controller.rb

SELECT "students".* FROM "students"
---
  def showstudents
    @show_students = Student.all

SELECT "librarians".* FROM "librarians" WHERE "librarians"."approved" IS NULL
---
  def librarianapprovals
    @pending_librarians = Librarian.where(approved: nil)

SELECT "hold_requests".* FROM "hold_requests" WHERE "hold_requests"."is_approved" = $1  [["is_approved", false]]
---
  def holdrequestapprovals
    @pending_hreq = HoldRequest.where(is_approved: false)