app/controllers/admin_home_controller.rb

SELECT "students".* FROM "students" WHERE "students"."is_active" IS NULL
---
  def showstudents
    @show_students = Student.where(is_active: nil)