app/controllers/bookmarks_controller.rb

SELECT "students".* FROM "students" WHERE "students"."email" = $1 LIMIT $2  [["email", "ajain37@ncsu.edu"], ["LIMIT", 1]]
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."student_id" = $1  [["student_id", 1]]
---
  def index
    if current_student.nil?
      @id = ''
    else
      @id = (Student.find_by email: current_student.email).id
    end
    @bookmarks = Bookmark.where(student_id: @id)

INSERT INTO "bookmarks" ("student_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["student_id", 1], ["book_id", 1], ["created_at", "2019-09-29 21:20:33.765522"], ["updated_at", "2019-09-29 21:20:33.765522"]]
---
  def create
    @bookmark = Bookmark.new(bookmark_params)

    respond_to do |format|
      if @bookmark.save