app/controllers/books_controller.rb

SELECT "students".* FROM "students" WHERE "students"."email" = $1 LIMIT $2  [["email", "ajain37@ncsu.edu"], ["LIMIT", 1]]
SELECT "books".* FROM "books"
---
  def index
    if current_student.nil?
      @id = ''
    else
      @id = (Student.find_by email: current_student.email).id
    end
    @books = Book.search(params[:search], @id)

INSERT INTO "books" ("isbn", "title", "author", "is_available", "language", "publish_date", "edition", "image", "subject", "summary", "is_special", "is_active", "count", "library_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"
---
  def create
    @book = Book.new(book_params)
    respond_to do |format|
      if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "degree_to_book_mappings".* FROM "degree_to_book_mappings" WHERE "degree_to_book_mappings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "issues" INNER JOIN "students" ON "students"."id" = "issues"."student_id" WHERE "students"."id" = $1  [["id", 2]]
INSERT INTO "hold_requests" ("book_id", "student_id", "is_approved", "day_count", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["book_id", 1], ["student_id", 2], ["is_approved", false], ["day_count", 0], ["created_at", "2019-10-07 21:37:55.931376"], ["updated_at", "2019-10-07 21:37:55.931376"]]
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def student_check_out
    student = Student.find_by email: current_student.email
    @max_books_count = DegreeToBookMapping.find(student.degree_to_book_mappings_id).book_count
    @current_count = Issue.joins(:student).where(students: {id: student.id}).count

    if @current_count >= @max_books_count || @book.is_special || @book.count.zero?
      # render(
      #     html: "<script>alert('Exceeded the maximum no. of books you can check out! We are putting a hold request for you.')</script>".html_safe,
      #     layout: 'application'
      # )

      @holdreq = HoldRequest.new
      @holdreq.book_id = @book.id
      @holdreq.student_id = student.id
      @holdreq.is_approved = false
      @holdreq.day_count = 0

      respond_to do |format|
        if @holdreq.save
          if @current_count >= @max_books_count
            format.html { redirect_to @book, notice: 'Exhausted limit for checking out books. Pending hold request registered.' }
            format.json { render :show, status: :created, location: @book }
          elsif @book.is_special
            format.html { redirect_to @book, notice: 'This book belongs to our special collection. Pending hold request registered.' }
            format.json { render :show, status: :created, location: @book }
          elsif @book.count.zero?

SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_audits" ("isbn", "title", "author", "is_available", "language", "publish_date", "edition", "image", "subject", "summary", "book_id", "issued_date", "student_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
INSERT INTO "issues" ("student_id", "book_id", "issued_from", "fine", "due_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
UPDATE "books" SET "count" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["count", 4], ["updated_at", "2019-10-07 21:36:53.133676"], ["id", 1]]
---
  def check_out(student)
    @book_audit = BookAudit.new
    @book_audit.book_id = @book.id
    @book_audit.isbn = @book.isbn
    @book_audit.title = @book.title
    @book_audit.author = @book.author
    @book_audit.is_available = @book.is_available
    @book_audit.language = @book.language
    @book_audit.publish_date = @book.publish_date
    @book_audit.edition = @book.edition
    @book_audit.image = @book.image
    @book_audit.subject = @book.subject
    @book_audit.summary = @book.summary
    @book_audit.student_id = @student.id
    @book_audit.summary = @book.summary
    @book_audit.issued_date = Date.today

    @book.count = @book.count - 1

    @issue = Issue.new
    @issue.student_id = student.id
    @issue.book_id = @book.id
    @issue.issued_from = Date.today
    @issue.fine = 0
    @max_days_count = Library.find(@book.library_id).max_borrow_count
    @issue.due_date = Time.now + @max_days_count.days

    respond_to do |format|
      if @book_audit.save && @book.save && @issue.save