app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE (lower(title) LIKE 'sample')
SELECT "students".* FROM "students" WHERE "students"."email" = $1 LIMIT $2  [["email", "jn.ayush@gmail.com"], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "libraries".* FROM "libraries" WHERE "libraries"."university" = $1 LIMIT $2  [["university", "NCSU"], ["LIMIT", 1]]
SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "librarians".* FROM "librarians" WHERE "librarians"."email" = $1 LIMIT $2  [["email", "ajain37@ncsu.edu"], ["LIMIT", 1]]
---
  def search(search, current_user)
    if current_user == 'admin'
      if search.blank?
        @books = Book.all
      else
        @l_search = search.downcase
        @books = Book.all.where("(lower(title) LIKE :search OR lower(author) LIKE :search)", search: "%#{@l_search}%")
      end
    elsif current_user == 'student'
      @id = (Student.find_by email: current_student.email).id
      @univ = Student.find(@id).university
      @lib = (Library.find_by university: @univ)
      if search.blank?
        if @lib.nil?
          @books = Hash.new
        else
          @books = Book.all.where("library_id = :library", library: "#{@lib.id}")
        end
      else
        @l_search = search.downcase
        @books = Book.all.where("(lower(title) LIKE :search OR lower(author) LIKE :search) and library_id = :library", search: "%#{@l_search}%", library: "#{@lib}")
      end
    elsif current_user == 'librarian'
      @librarian = Librarian.find_by email: current_librarian.email
      @lib = Library.find(@librarian.library_id)

INSERT INTO "books" ("isbn", "title", "author", "is_available", "language", "publish_date", "edition", "image", "subject", "summary", "is_special", "is_active", "count", "library_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"
---
  def create
    @book = Book.new(book_params)
    respond_to do |format|
      if @book.save

UPDATE "books" SET "image" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["image", "IMG_0434-2.jpg"], ["updated_at", "2019-09-30 02:59:08.101953"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)

SELECT "students".* FROM "students" WHERE "students"."email" = $1 LIMIT $2  [["email", "ajain37@ncsu.edu"], ["LIMIT", 1]]
INSERT INTO "bookmarks" ("student_id", "book_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["student_id", 1], ["book_id", 1], ["created_at", "2019-10-09 15:29:49.432192"], ["updated_at", "2019-10-09 15:29:49.432192"]]
---
  def bookmark
    @bookmark = Bookmark.new
    @bookmark.book_id = @book.id
    @bookmark.student_id = (Student.find_by email: current_student.email).id

    respond_to do |format|
      if @bookmark.save

SELECT "books".* FROM "books"
---
  def update_to_lib
    @books = Book.all

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "count" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["count", 11], ["updated_at", "2019-10-09 15:24:41.845077"], ["id", 1]]
---
  def add_to_lib
    # count = Book.find_by(library_id: student_id, id: @book.id)
    if @book.nil?
      book = Book.find_by(id: params[:param_1])
      @book = book.dup
      @book.count = 1
      @book.library_id = params[:param_2]
    else
      @book.count = @book.count + 1
    end
    respond_to do |format|
      if @book.save

UPDATE "books" SET "count" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["count", 9], ["updated_at", "2019-10-09 15:32:18.548535"], ["id", 1]]
---
  def remove_from_lib
    @book.count = @book.count - 1
    if @book.count == 0
      respond_to do |format|
        if @book.destroy
          format.html { redirect_to @book, notice: 'Book was successfully removed from the library.' }
          format.json { render :show, status: :created, location: @book }
        else
          format.html { render :new }
          format.json { render json: @book.errors, status: :unprocessable_entity }
        end
      end
    else
      respond_to do |format|
        if @book.save

SELECT "hold_requests".* FROM "hold_requests" WHERE "hold_requests"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "hold_requests" WHERE "hold_requests"."id" = $1  [["id", 9]]
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def admin_check_out
    @hreq = HoldRequest.find(params[:id])
    @hreq.destroy
    @student = Student.find(params[:param_1])
    @book = Book.find(params[:param_2])

SELECT "students".* FROM "students" WHERE "students"."email" = $1 LIMIT $2  [["email", "ajain37@ncsu.edu"], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."id" = $1 ORDER BY "students"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "degree_to_book_mappings".* FROM "degree_to_book_mappings" WHERE "degree_to_book_mappings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "issues" INNER JOIN "students" ON "students"."id" = "issues"."student_id" WHERE "students"."id" = $1  [["id", 1]]
INSERT INTO "hold_requests" ("book_id", "student_id", "is_approved", "day_count", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["book_id", 1], ["student_id", 1], ["is_approved", false], ["day_count", 0], ["created_at", "2019-10-10 02:24:42.225270"], ["updated_at", "2019-10-10 02:24:42.225270"]]
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def student_check_out
    student = Student.find_by email: current_student.email
    @max_books_count = DegreeToBookMapping.find(student.degree_to_book_mappings_id).book_count
    @current_count = Issue.joins(:student).where(students: {id: student.id}).count

    if @current_count >= @max_books_count || @book.is_special || @book.count.zero?
      # render(
      #     html: "<script>alert('Exceeded the maximum no. of books you can check out! We are putting a hold request for you.')</script>".html_safe,
      #     layout: 'application'
      # )

      @holdreq = HoldRequest.new
      @holdreq.book_id = @book.id
      @holdreq.student_id = student.id
      @holdreq.is_approved = false
      @holdreq.day_count = 0

      respond_to do |format|
        if @holdreq.save
          if @current_count >= @max_books_count
            format.html { redirect_to hold_requests_path, notice: 'Exhausted limit for checking out books. Pending hold request registered.' }
            format.json { render :show, status: :created, location: @book }
          elsif @book.is_special
            format.html { redirect_to hold_requests_path, notice: 'This book belongs to our special collection. Pending hold request registered.' }
            format.json { render :show, status: :created, location: @book }
          elsif @book.count.zero?

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_audits" ("isbn", "title", "author", "is_available", "language", "publish_date", "edition", "image", "subject", "summary", "book_id", "issued_date", "student_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
INSERT INTO "issues" ("student_id", "book_id", "issued_from", "fine", "due_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
UPDATE "books" SET "count" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["count", 10], ["updated_at", "2019-10-09 15:28:08.125731"], ["id", 1]]
---
  def check_out(student)
    @book_audit = BookAudit.new
    @book_audit.book_id = @book.id
    @book_audit.isbn = @book.isbn
    @book_audit.title = @book.title
    @book_audit.author = @book.author
    @book_audit.is_available = @book.is_available
    @book_audit.language = @book.language
    @book_audit.publish_date = @book.publish_date
    @book_audit.edition = @book.edition
    @book_audit.image = @book.image
    @book_audit.subject = @book.subject
    @book_audit.summary = @book.summary
    @book_audit.student_id = student.id
    @book_audit.summary = @book.summary
    @book_audit.issued_date = Date.today

    @book.count = @book.count - 1

    @issue = Issue.new
    @issue.student_id = student.id
    @issue.book_id = @book.id
    @issue.issued_from = Date.today
    @issue.fine = 0
    @max_days_count = Library.find(@book.library_id).max_borrow_count
    @issue.due_date = Time.now + @max_days_count.days

    respond_to do |format|
      if @book_audit.save && @book.save && @issue.save

SELECT "books".* FROM "books" WHERE "books"."library_id" = $1 AND "books"."id" = $2 LIMIT $3  [["library_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def set_book_for_lib
    @book = Book.find_by(library_id: params[:param_2], id: params[:param_1])