app/controllers/book_audits_controller.rb

    def set_book_audit
      @book_audit = BookAudit.find(params[:id])
---
SELECT "book_audits".* FROM "book_audits" WHERE "book_audits"."book_id" = $1  [["book_id", 1]]