app/controllers/degree_to_book_mappings_controller.rb

  def index
    @degree_to_book_mappings = DegreeToBookMapping.all
---
SELECT "degree_to_book_mappings".* FROM "degree_to_book_mappings"

  def create
    @degree_to_book_mapping = DegreeToBookMapping.new(degree_to_book_mapping_params)

    respond_to do |format|
      if @degree_to_book_mapping.save
---
INSERT INTO "degree_to_book_mappings" ("educational_level", "book_count", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["educational_level", "Masters"], ["book_count", 2], ["created_at", "2019-10-03 21:57:05.625941"], ["updated_at", "2019-10-03 21:57:05.625941"]]

    def set_degree_to_book_mapping
      @degree_to_book_mapping = DegreeToBookMapping.find(params[:id])
---
SELECT "degree_to_book_mappings".* FROM "degree_to_book_mappings" WHERE "degree_to_book_mappings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]