app/controllers/hold_requests_controller.rb

SELECT "hold_requests".* FROM "hold_requests"
---
  def index
    @hold_requests = HoldRequest.all

DELETE FROM "hold_requests" WHERE "hold_requests"."id" = $1  [["id", 11]]
---
  def destroy
    @hold_request.destroy

SELECT "hold_requests".* FROM "hold_requests" WHERE "hold_requests"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def set_hold_request
    @hold_request = HoldRequest.find(params[:id])