app/controllers/issues_controller.rb

  def index
    if current_student.nil?
      @id = ''
    else
      @id = (Student.find_by email: current_student.email).id
---
SELECT "students".* FROM "students" WHERE "students"."email" = $1 LIMIT $2  [["email", "ajain37@ncsu.edu"], ["LIMIT", 1]]

  def set_issue
    @issue = Issue.find(params[:id])
---
SELECT "issues".* FROM "issues" WHERE "issues"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]