app/controllers/issues_controller.rb

  def index
    if @current_user == 'librarian'
      @lid = current_librarian.library_id
      @issues = Issue.joins("INNER JOIN books ON books.id = issues.book_id WHERE books.library_id = #{@lid}")
    elsif @current_user == 'student'
      @issues = Issue.where(student_id: current_student.id)
    else
      @issues = Issue.all
---
SELECT "issues".* FROM "issues" INNER JOIN books ON books.id = issues.book_id WHERE books.library_id = 1
SELECT "issues".* FROM "issues" WHERE "issues"."student_id" = $1  [["student_id", 1]]
SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show_overdue
    if @current_user == 'student'
      @lid = current_librarian.library_id
      @issues = Issue.joins("INNER JOIN books ON books.id = issues.book_id AND issues.due_date < current_date WHERE books.library_id = #{@lid}")
---
SELECT "issues".* FROM "issues" INNER JOIN books ON books.id = issues.book_id AND issues.due_date < current_date

  def return
    @book = Book.find(@issue.book_id)
    @book.count = @book.count + 1
    @book_audit = BookAudit.find_by book_id: @issue.book_id
    @book_audit.returned_date = Date.today

    @book_audit.save
    @book.save
    @issue.destroy

    @hreq = HoldRequest.find_by book_id: @book.id
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "book_audits".* FROM "book_audits" WHERE "book_audits"."book_id" = $1 LIMIT $2  [["book_id", 1], ["LIMIT", 1]]
UPDATE "books" SET "count" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["count", 4], ["updated_at", "2019-10-07 21:38:15.095063"], ["id", 1]]
UPDATE "book_audits" SET "returned_date" = $1, "updated_at" = $2 WHERE "book_audits"."id" = $3  [["returned_date", "2019-10-09"], ["updated_at", "2019-10-10 02:24:56.801580"], ["id", 23]]
UPDATE "books" SET "count" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["count", 12], ["updated_at", "2019-10-10 02:24:56.812803"], ["id", 1]]
DELETE FROM "issues" WHERE "issues"."id" = $1  [["id", 19]]
SELECT "hold_requests".* FROM "hold_requests" WHERE "hold_requests"."book_id" = $1 LIMIT $2  [["book_id", 1], ["LIMIT", 1]]

  def set_issue
    @issue = Issue.find(params[:id])
---
SELECT "issues".* FROM "issues" WHERE "issues"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]