app/controllers/librarians_controller.rb

SELECT "librarians".* FROM "librarians"
---
  def index
    @librarians = Librarian.all

DELETE FROM "librarians" WHERE "librarians"."id" = $1  [["id", 1]]
---
  def destroy
    @librarian.destroy

SELECT "librarians".* FROM "librarians" WHERE "librarians"."id" = $1 ORDER BY "librarians"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "librarians" SET "approved" = $1, "updated_at" = $2 WHERE "librarians"."id" = $3  [["approved", true], ["updated_at", "2019-10-03 23:04:54.926820"], ["id", 1]]
---
  def approve_librarian
    librarian_id = params[:id]
    librarian_obj = Librarian.where(id: librarian_id).first
    librarian_obj.approved = true
    librarian_obj.save

SELECT "librarians".* FROM "librarians" WHERE "librarians"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_librarian
    @librarian = Librarian.find(params[:id])