app/controllers/libraries_controller.rb

SELECT "libraries".* FROM "libraries"
---
  def index
    @libraries = Library.all

INSERT INTO "libraries" ("name", "university", "location", "max_borrow_count", "fine", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @library = Library.new(library_params)

    respond_to do |format|
      if @library.save

UPDATE "libraries" SET "name" = ?, "updated_at" = ? WHERE "libraries"."id" = ?  [["name", "ayushjain"], ["updated_at", "2019-09-28 03:53:23.827238"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @library.update(library_params)

SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_library
      @library = Library.find(params[:id])