app/models/book.rb

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "libraries".* FROM "libraries" WHERE "libraries"."university" = $1 LIMIT $2  [["university", "NCSU"], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def self.search(search, id)
    if search.blank? && id.blank?
      @books = Book.all.where("count > 0")
    elsif search.blank?
      @univ = Student.find(id).university
      @lib = Library.find_by university: @univ
      if @lib.nil?
        @books = Hash.new
      else
        @books = Book.all.where("library_id = :library", library: "#{@lib.id}")
      end
    elsif id.blank?
      @l_search = search.downcase
      @books = Book.all.where("(lower(title) LIKE :search OR lower(author) LIKE :search) and count > 0", search: "%#{@l_search}%")
    else
      @univ = Student.find(id).university