app/models/student.rb

  def self.new_with_session(params, session)
    super.tap do |student|
      if data = session["devise.facebook_data"] && session["devise.facebook_data"]["extra"]["raw_info"]
        student.email = data["email"] if student.email.blank?
---
SELECT 1 AS one FROM "students" WHERE "students"."email" = $1 LIMIT $2  [["email", "jn.ayush@gmail.com"], ["LIMIT", 1]]

  def self.from_omniauth(auth)
    where(provider: auth.provider, uid: auth.uid).first_or_create do |student|
---
INSERT INTO "students" ("email", "encrypted_password", "university", "created_at", "updated_at", "name", "degree_to_book_mappings_id", "provider", "uid") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT "students".* FROM "students" WHERE "students"."provider" = $1 AND "students"."uid" = $2 ORDER BY "students"."id" ASC LIMIT $3  [["provider", "facebook"], ["uid", "10217399611893742"], ["LIMIT", 1]]