app/views/admin_home/holdrequestapprovals.html.erb

  <% @pending_hreq.each do |req| %>
    <% book = Book.find(req.book_id) %>
    <% student = Student.find(req.student_id) %>
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]