app/views/layouts/application.html.erb

        <!--Get current student id from email-->
        <% id = (Student.find_by email: current_student.email).id %>
---
SELECT "students".* FROM "students" WHERE "students"."email" = $1 LIMIT $2  [["email", "jn.ayush@gmail.com"], ["LIMIT", 1]]