app/views/students/registrations/edit.html.erb

SELECT "degree_to_book_mappings".* FROM "degree_to_book_mappings"
---

  <%= f.select :degree_to_book_mappings_id, DegreeToBookMapping.all.collect { |c| [c.educational_level, c.id] }, { label: "Degree level: ", wrapper: {class: "selectpicker"}} %>