app/views/students/registrations/new.html.erb


      <%= f.select :degree_to_book_mappings_id, DegreeToBookMapping.all.collect { |c| [c.educational_level, c.id] }, { label: "Chose your degree level: ", wrapper: {class: "selectpicker"}} %>
---
SELECT "degree_to_book_mappings".* FROM "degree_to_book_mappings"