app/views/students/registrations/new.html.erb

SELECT "degree_to_book_mappings".* FROM "degree_to_book_mappings"
---
      <%= f.label :degree_to_book_mapping_id %>
      <%= select("student", "degree_to_book_mappings_id", DegreeToBookMapping.all.collect { |c| [c.educational_level, c.id] }) %>